Revit 2024 API
ProjectLocationSet Properties
The ProjectLocationSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Size
Returns the number of project locations that are in the set.
See Also
ProjectLocationSet Class
Autodesk.Revit.DB Namespace